#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

//5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果：
//A选手说：B第二，我第三；
//B选手说：我第二，E第四；
//C选手说：我第一，D第二；
//D选手说：C最后，我第三；
//E选手说：我第四，A第一；
//比赛结束后，每位选手都说对了一半，请编程确定比赛的名次

int main()
{
	int A = 0, B = 0, C = 0, D = 0, E = 0;
	for (A = 0; A <= 5; A++)
	{
		for (B = 0; B <= 5; B++)
		{
			for (C = 0; C <= 5; C++)
			{
				for (D = 0; D <= 5; D++)
				{
					for (E = 0; E <= 5; E++)
					{
						if (   ((B == 2) + (A == 3) == 1)
							&& ((B == 2) + (E == 4) == 1)
							&& ((C == 1) + (D == 2) == 1)
							&& ((C == 5) + (D == 3) == 1)
							&& ((E == 4) + (A == 1) == 1))
						{
							if (A + B + C + D + E == 15 && A * B * C * D * E == 120)
							{
								printf("A=%d B=%d C=%d D=%d E=%d\n", A, B, C, D, E);
							}
						}
					}
				}
			}
		}
	}
	return 0;
}




//-----------------------------------------------
//日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个嫌疑犯的一个。
//以下为4个嫌疑犯的供词:
//A说：不是我。
//B说：是C。
//C说：是D。
//D说：C在胡说
//已知3个人说了真话，1个人说的是假话。
//现在请根据这些信息，写一个程序来确定到底谁是凶手
//
//int main()
//{
//	int killer = 0;
//	for (killer = 'A'; killer <= 'D'; killer++)
//	{
//		if ((killer != 'A') + (killer == 'C') + (killer == 'D') + (killer != 'D') == 3)
//		{
//			printf("killer is %c\n", killer);
//		}
//	}
//	return 0;
//}




//-----------------------------------------------
//在屏幕上打印杨辉三角
//
//int main()
//{
//	int line = 0;
//	scanf("%d", &line);
//	int arr[30][30] = { 0 };
//	int i = 0;
//	int j = 0;
//	arr[0][0] = 1;
//	for (i = 1; i < line; i++)
//	{
//		arr[i][0] = 1;
//		for (j = 1; j <= i; j++)
//		{
//			arr[i][j] = arr[i - 1][j - 1] + arr[i - 1][j];
//		}
//	}
//	for (i = 0; i < line; i++)
//	{
//		for (j = 0; j <= i; j++)
//		{
//			printf("%d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
//}