#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

//-----------------------------------------------
//小乐乐最近在课上学习了如何求两个正整数的最大公约数与最小公倍数，但是他
//竟然不会求两个正整数的最大公约数与最小公倍数之和，请你帮助他解决这个问题。
//输入描述：
//每组输入包含两个正整数n和m。(1 ≤ n ≤ 10^9，1 ≤ m ≤ 10^9)
//输出描述：
//对于每组输入，输出一个正整数，为n和m的最大公约数与最小公倍数之和。
//
//int main()
//{
//	long long n = 0;
//	long long m = 0;
//	scanf("%lld %lld", &n, &m);
//	long long k = m * n;
//	while (n && m)
//	{
//		if (n > m)
//		{
//			n %= m;
//		}
//		else
//		{
//			m %= n;
//		}
//	}
//	long long gcd = n > m ? n : m;
//	long long lcm = k / gcd;
//	printf("%lld\n", gcd + lcm);
//	return 0;
//}




//-----------------------------------------------
//KiKi学习了循环，BoBo老师给他出了一系列打印图案的练习，该任务是打印用“* ”组成的“空心”正方形图案。
//输入描述：
//多组输入，一个整数（3~20），表示输出的行数，也表示组成正方形边的“ * ”的数量。
//输出描述：
//针对每行输入，输出用“ * ”组成的“空心”正方形，每个“ * ”后面有一个空格。
//
//int main()
//{
//	int n = 0;
//	while (scanf("%d", &n) != EOF)
//	{
//		int i = 0;
//		int j = 0;
//		for (i = 0; i < n; i++)
//		{
//			for (j = 0; j < n; j++)
//			{
//				if (i == 0 || i == n - 1)
//				{
//					printf("* ");
//				}
//				else if (j == 0 || j == n - 1)
//				{
//					printf("* ");
//				}
//				else
//				{
//					printf("  ");
//				}
//			}
//			printf("\n");
//		}
//	}
//	return 0;
//}




//-----------------------------------------------
//KiKi学习了循环，BoBo老师给他出了一系列打印图案的练习，该任务是打印用“* ”组成的箭形图案。
//输入描述：
//本题多组输入，每行一个整数（2~20）。
//输出描述：
//针对每行输入，输出用“ * ”组成的箭形。
//
//int main()
//{
//	int n = 0;
//	while (scanf("%d", &n) != EOF)
//	{
//		int i = 0;
//		int j = 0;
//		for (i = 0; i < n + 1; i++)
//		{
//			for (j = 0; j < 2 * (n - i); j++)
//			{
//				printf(" ");
//			}
//			for (j = 0; j <= i; j++)
//			{
//				printf("*");
//			}
//			printf("\n");
//		}
//		for (i = 0; i < n; i++)
//		{
//			for (j = 0; j < 2 * (i + 1); j++)
//			{
//				printf(" ");
//			}
//			for (j = 0; j < n - i; j++)
//			{
//				printf("*");
//			}
//			printf("\n");
//		}
//	}
//	return 0;
//}




//-----------------------------------------------
//公务员面试现场打分。有7位考官，从键盘输入若干组成绩，每组7个分数（百分制），
//去掉一个最高分和一个最低分，输出每组的平均成绩。（注：本题有多组输入）
//输入描述：
//每一行，输入7个整数（0~100），代表7个成绩，用空格分隔。
//输出描述：
//每一行，输出去掉最高分和最低分的平均成绩，小数点后保留2位，每行输出后换行。

int main()
{
	int arr[7] = { 0 };
	while (scanf("%d %d %d %d %d %d %d", &arr[0], &arr[1], &arr[2], &arr[3], &arr[4], &arr[5], &arr[6]) != EOF)
	{
		int max = arr[0];
		int min = arr[0];
		int i = 0;
		for (i = 0; i < 7; i++)
		{
			if (arr[i] > max)
			{
				max = arr[i];
			}
			if (arr[i] < min)
			{
				min = arr[i];
			}
		}
		double sum = 0.0;
		for (i = 0; i < 7; i++)
		{
			sum += arr[i];
		}
		printf("%.2lf\n", (sum - max - min) / 5.0);
	}
	return 0;
}